task4/Case folder/Re150_1000_160/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (0.0046875 0 0);
    }

    outlet
    {
        type            zeroGradient;//? shouldn't it be a fixedGradient
        
    }

   top
    {
        type            fixedValue;
        value            uniform (0 0 0);
    }
    bottom
    {
        type            fixedValue;
        value            uniform (0 0 0);
    }
  cylinder
    {
        type            fixedValue;
		value           uniform (0 0 0);
    }
    sides
    {
		type 			empty;
	}
}

// ************************************************************************* //
